/* State and Keywordgroupnames */

"P3 Types" = "string int double bool hash";
"P3 Keywords" = "^if(true){ omg! it's true }";

"P3 Base Classes" = "@CLASS @USE @OPTIONS @BASE";
"P3 Classes" = "^hash::create[] ^void:sql{}";

"P3 User Method" = "@myMethod[a;b;c]";
"P3 Call User Method" = "^myMethod[1;2;3]";

"P3 Variables" = "$variable";

"P3 Numbers" = "0 15 0x4a 0713 3.14";
"P3 Boolean" = "true false";
"P3 String" = "lorem ipsum";
"P3 RegExp" = "^(\w*)$";

"P3 Block Comment" = "^rem{ Comment }";
"P3 Inline Comment" = "^rem{ Comment }";
"P3 Single Comment" = "# Comment";
"P3 TODO Comment" = "#TODO Comment";
"P3 Autodoc Comment" = "# \"Comment\"";

"/Base/PrefixlessURLs" = "www.apple.com";
"/Base/Emails" = "steve@apple.com";
"/Base/URLs" = "see://another.com/document?id=123";


/*

"Entities" = "HTML Entities";
"Comment" = "<!-- Comment -->";
"CDATA" = "<![CDATA[...]]>";
"Doctype" = "<!Declaration>";
"Escape" = "<?Prologue?>";

"/XML/Tags" = "Tags";
"/XML/Strings in Tags" = "\"Strings in Tags\"";
"/XML/Single Strings in Tags" = "'Strings in Tags'";
"/XML/Attributes in Tags" = "Attributes in Tags";
"/XML/Entities" = "Entities";

*/